import random
variants = ["камень", "ножницы", "бумага", "ящерица", "спок"]
user = input("Выберите: камень, ножницы, бумага, ящерица, спок: ").lower()
comp = random.choice(variants)
print(f"Компьютер выбрал: {comp}")
if user == comp:
    print("Ничья!")
elif (user, comp) in [("ножницы", "бумага"), ("бумага", "камень"), ("камень", "ящерица"), 
                      ("ящерица", "спок"), ("спок", "ножницы"), ("ножницы", "ящерица"), 
                      ("ящерица", "бумага"), ("бумага", "спок"), ("спок", "камень"), 
                      ("камень", "ножницы")]:
    print("Вы победили!")
else:
    print("Вы проиграли!")